examples/openfoam_airfoil_shellscript/airfoil_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    timeStep;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    
    forceCoeffs1
	{
    // Mandatory entries
    type            forceCoeffs;
    libs            ("libforces.so");
    patches         (airfoil);

    // Optional entries

    // Field names
    p               p;
    U               U;
    rho             rhoInf;
    rhoInf      1000;

    // Reference pressure [Pa]
    pRef            0;

    // Include porosity effects?
    porosity        no;

    // Store and write volume field representations of forces and moments
    writeFields     no;

    // Centre of rotation for moment calculations
    CofR            (0 0 0);

    // Lift direction
    liftDir         (-0.17571037184 0 0.98444190546);

    // Drag direction
    dragDir         (0.98444190546 0 0.17571037184);

    // Pitch axis
    pitchAxis       (0 1 0);

    // Freestream velocity magnitude [m/s]
    magUInf         51.4815;

    // Reference length [m]
    lRef            1;

    // Reference area [m2]
    Aref            1;

	}
	yPlus1
    {
    type        yPlus;
    libs        ("libfieldFunctionObjects.so");
    writeControl timeStep;
    writeInterval $writeInterval;
    }
}


// ************************************************************************* //
