examples/openfoam_airfoil_shellscript/airfoil_template/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          224;
        startFace       28432;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       28656;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          128;
        startFace       28784;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28672;
        startFace       28912;
    }
)

// ************************************************************************* //
